Documents/Анкета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>Анкета</Name>
			<BasedOn>
				<xr:Item>Document.РасчетИпотеки</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОтветыНаВопросыАнкет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Опрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеОпросов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Респондент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Респондент</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРедактирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактируемыйРаздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыШаблонаАнкеты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетИпотеки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасчетИпотеки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Интервьюер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Интервьюер</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныАнкет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимАнкетирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыАнкетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВопросыШаблонаАнкеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементарныйВопрос</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЯчейки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВопросыДляАнкетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОткрытыйОтвет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОтветыНаВопросыАнкет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ОтветыНаВопросыАнкет</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВопросыДляАнкетирования</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОткрытыйОтвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСпецСимволДляЗамены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПараметраЗаполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСпецСимволДляЗаменыОтвет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксВопрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксОтвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуффиксВопрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуффиксОтвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Анкета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Анкета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вопрос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыШаблонаАнкеты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭлементарныйВопрос</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЯчейки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПараметрПечатиВопрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПараметрПечатиОтвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДокументыФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ДокументыФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвляетсяДокументомУдостоверяющимЛичность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СвидетельстваОРожденииФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>СвидетельстваОРожденииФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаАкта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтецФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтецНациональность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МатьФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МатьНациональность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ГражданствоФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ГражданствоФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПолФизическогоЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ПолФизическогоЛица</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Анкета/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Движения.ОтветыНаВопросыАнкет.Записывать = Истина;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ТаблицаСостав.Вопрос,
	//               |	ТаблицаСостав.ЭлементарныйВопрос,
	//               |	ТаблицаСостав.НомерЯчейки,
	//               |	ТаблицаСостав.Ответ,
	//               |	ТаблицаСостав.ОткрытыйОтвет,
	//               |	ТаблицаСостав.НомерСтроки,
	//               |	ТаблицаСостав.ПараметрПечати
	//               |ПОМЕСТИТЬ Состав
	//               |ИЗ
	//               |	&ТаблицаСостав КАК ТаблицаСостав
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	Состав.Вопрос,
	//               |	Состав.ЭлементарныйВопрос,
	//               |	Состав.НомерЯчейки,
	//               |	Состав.Ответ,
	//               |	Состав.ОткрытыйОтвет,
	//               |	ИСТИНА КАК Активность,
	//               |	&Ссылка КАК Регистратор,
	//               |	&Ссылка КАК Анкета,
	//               |	Состав.НомерСтроки КАК НомерСтроки
	//               |ИЗ
	//               |	Состав КАК Состав ";
	
	//<590625>, Басаргин (19.12.2016) {
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ТаблицаСостав.Вопрос,
	//|	ТаблицаСостав.ЭлементарныйВопрос,
	//|	ТаблицаСостав.НомерЯчейки,
	//|	ТаблицаСостав.Ответ,
	//|	ТаблицаСостав.ОткрытыйОтвет,
	//|	ТаблицаСостав.НомерСтроки
	//|ПОМЕСТИТЬ Состав
	//|ИЗ
	//|	&ТаблицаСостав КАК ТаблицаСостав
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Состав.Вопрос,
	//|	Состав.ЭлементарныйВопрос,
	//|	Состав.НомерЯчейки,
	//|	Состав.Ответ,
	//|	Состав.ОткрытыйОтвет,
	//|	ИСТИНА КАК Активность,
	//|	&Ссылка КАК Регистратор,
	//|	&Ссылка КАК Анкета,
	//|	Состав.НомерСтроки КАК НомерСтроки,
	//|	ВЫБОР
	//|		КОГДА (ВопросыДляАнкетирования.Ссылка.ТипОтвета = ЗНАЧЕНИЕ(Перечисление.ТипыОтветовНаВопрос.ОдинВариантИз)
	//|				ИЛИ ВопросыДляАнкетирования.Ссылка.ТипОтвета = ЗНАЧЕНИЕ(Перечисление.ТипыОтветовНаВопрос.НесколькоВариантовИз))
	//|				И ЕСТЬNULL(ВопросыДляАнкетирования.Ссылка.ПараметрПечати, """") = """"
	//|				И Состав.Ответ ССЫЛКА Справочник.ВариантыОтветовАнкет
	//|			ТОГДА ЕСТЬNULL(ВариантыОтветовАнкет.ПараметрПечати, """")
	//|		ИНАЧЕ ЕСТЬNULL(ВопросыДляАнкетирования.Ссылка.ПараметрПечати, """")
	//|	КОНЕЦ КАК ПараметрПечати,
	//|	ВЫБОР
	//|		КОГДА (ВопросыДляАнкетирования.Ссылка.ТипОтвета = ЗНАЧЕНИЕ(Перечисление.ТипыОтветовНаВопрос.ОдинВариантИз)
	//|				ИЛИ ВопросыДляАнкетирования.Ссылка.ТипОтвета = ЗНАЧЕНИЕ(Перечисление.ТипыОтветовНаВопрос.НесколькоВариантовИз))
	//|				И ЕСТЬNULL(ВопросыДляАнкетирования.Ссылка.ПараметрПечати, """") = """"
	//|				И Состав.Ответ ССЫЛКА Справочник.ВариантыОтветовАнкет
	//|			ТОГДА ЕСТЬNULL(ВариантыОтветовАнкет.ПрефиксПараметраПечати, """")
	//|		ИНАЧЕ ЕСТЬNULL(ВопросыДляАнкетирования.Ссылка.ПрефиксПараметраПечати, """")
	//|	КОНЕЦ КАК Префикс,
	//|	ВЫБОР
	//|		КОГДА (ВопросыДляАнкетирования.Ссылка.ТипОтвета = ЗНАЧЕНИЕ(Перечисление.ТипыОтветовНаВопрос.ОдинВариантИз)
	//|				ИЛИ ВопросыДляАнкетирования.Ссылка.ТипОтвета = ЗНАЧЕНИЕ(Перечисление.ТипыОтветовНаВопрос.НесколькоВариантовИз))
	//|				И ЕСТЬNULL(ВопросыДляАнкетирования.Ссылка.ПараметрПечати, """") = """"
	//|				И Состав.Ответ ССЫЛКА Справочник.ВариантыОтветовАнкет
	//|			ТОГДА ЕСТЬNULL(ВариантыОтветовАнкет.СуффиксПараметраПечати, """")
	//|		ИНАЧЕ ЕСТЬNULL(ВопросыДляАнкетирования.Ссылка.СуффиксПараметраПечати, """")
	//|	КОНЕЦ КАК Суффикс,
	//|	ВЫБОР
	//|		КОГДА (ВопросыДляАнкетирования.Ссылка.ТипОтвета = ЗНАЧЕНИЕ(Перечисление.ТипыОтветовНаВопрос.ОдинВариантИз)
	//|				ИЛИ ВопросыДляАнкетирования.Ссылка.ТипОтвета = ЗНАЧЕНИЕ(Перечисление.ТипыОтветовНаВопрос.НесколькоВариантовИз))
	//|				И НЕ ВопросыДляАнкетирования.Ссылка.ИспользоватьСпецСимволДляЗамены
	//|				И Состав.Ответ ССЫЛКА Справочник.ВариантыОтветовАнкет
	//|			ТОГДА ЕСТЬNULL(ВариантыОтветовАнкет.ИспользоватьСпецСимволДляЗамены, ЛОЖЬ)
	//|		ИНАЧЕ ЕСТЬNULL(ВопросыДляАнкетирования.Ссылка.ИспользоватьСпецСимволДляЗамены, ЛОЖЬ)
	//|	КОНЕЦ КАК ИспользоватьСпецСимволДляЗамены
	//|ИЗ
	//|	Состав КАК Состав
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ВопросыДляАнкетирования КАК ВопросыДляАнкетирования
	//|		ПО Состав.ЭлементарныйВопрос = ВопросыДляАнкетирования.Ссылка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыОтветовАнкет КАК ВариантыОтветовАнкет
	//|		ПО Состав.ЭлементарныйВопрос = ВариантыОтветовАнкет.Владелец
	//|			И Состав.Ответ = ВариантыОтветовАнкет.Ссылка";	
	//<590625> }
	
	//<возможность добавлять параметры в ПВХ и в  Справочник.ВариантыОтветовАнкет одновременно>, Басаргин (17.02.2017) {
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСостав.Вопрос,
	|	ТаблицаСостав.ЭлементарныйВопрос,
	|	ТаблицаСостав.НомерЯчейки,
	|	ТаблицаСостав.Ответ,
	|	ТаблицаСостав.ОткрытыйОтвет,
	|	ТаблицаСостав.НомерСтроки
	|ПОМЕСТИТЬ Состав
	|ИЗ
	|	&ТаблицаСостав КАК ТаблицаСостав
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Состав.Вопрос,
	|	Состав.ЭлементарныйВопрос,
	|	Состав.НомерЯчейки,
	|	Состав.Ответ,
	|	Состав.ОткрытыйОтвет,
	|	ИСТИНА КАК Активность,
	|	&Ссылка КАК Регистратор,
	|	&Ссылка КАК Анкета,
	|	&КонтактноеЛицо КАК КонтактноеЛицо,		
	|	Состав.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ВопросыДляАнкетирования.Ссылка.ПараметрПечати, """") КАК ПараметрПечатиВопрос,
	|	ЕСТЬNULL(ВопросыДляАнкетирования.Ссылка.ПрефиксПараметраПечати, """") КАК ПрефиксВопрос,
	|	ЕСТЬNULL(ВопросыДляАнкетирования.Ссылка.СуффиксПараметраПечати, """") КАК СуффиксВопрос,
	|	ЕСТЬNULL(ВопросыДляАнкетирования.Ссылка.ИспользоватьСпецСимволДляЗамены, ЛОЖЬ) КАК ИспользоватьСпецСимволДляЗамены,
	|	ЕСТЬNULL(ВариантыОтветовАнкет.ПараметрПечати, """") КАК ПараметрПечатиОтвет,
	|	ЕСТЬNULL(ВариантыОтветовАнкет.ПрефиксПараметраПечати, """") КАК ПрефиксОтвет,
	|	ЕСТЬNULL(ВариантыОтветовАнкет.СуффиксПараметраПечати, """") КАК СуффиксОтвет,
	|	ЕСТЬNULL(ВариантыОтветовАнкет.ИспользоватьСпецСимволДляЗамены, ЛОЖЬ) КАК ИспользоватьСпецСимволДляЗаменыОтвет
	|ИЗ
	|	Состав КАК Состав
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ВопросыДляАнкетирования КАК ВопросыДляАнкетирования
	|		ПО Состав.ЭлементарныйВопрос = ВопросыДляАнкетирования.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыОтветовАнкет КАК ВариантыОтветовАнкет
	|		ПО Состав.ЭлементарныйВопрос = ВариантыОтветовАнкет.Владелец
	|			И Состав.Ответ = ВариантыОтветовАнкет.Ссылка";	
	//<возможность добавлять параметры в ПВХ и в  Справочник.ВариантыОтветовАнкет одновременно> }
	
	Запрос.УстановитьПараметр("ТаблицаСостав",Состав);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("КонтактноеЛицо",Ссылка.КонтактноеЛицо);
	
	Движения.ОтветыНаВопросыАнкет.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ДанныеЗаполнения <> Неопределено Тогда
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасчетИпотеки") Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,, "Номер");
			// Заполнение шапки
			РасчетИпотеки = ДанныеЗаполнения.Ссылка;
			Ответственный = Пользователи.ТекущийПользователь();
			
			Если ЗначениеЗаполнено(РасчетИпотеки) И РасчетИпотеки.ДанныеОЗаемщиках.Количество() > 0 Тогда
				Клиент = РасчетИпотеки.ДанныеОЗаемщиках[0].ФИО;
				Если ЗначениеЗаполнено(Клиент) Тогда
					КонтактноеЛицо = Клиент;
					
					ЗаполнитьОтветыПоДаннымЗаполнения(2, ДанныеЗаполнения);
				КонецЕсли;
			КонецЕсли;
			
			ЗаполнитьОтветыПоДаннымЗаполнения(1, ДанныеЗаполнения);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьОтветыПоДаннымЗаполнения(Ключ, Расчет)   //1 - вопросы по расчету ипотеки, 2 - вопросы по физлицу
	
	МассивВопросов = Новый Массив;
	
	Если Ключ = 1 Тогда
		МассивВопросов.Добавить(Справочники.ВопросыШаблонаАнкеты.НайтиПоНаименованию("Семейное положение"));
		МассивВопросов.Добавить(Справочники.ВопросыШаблонаАнкеты.НайтиПоНаименованию("Стоимость ОН"));
		МассивВопросов.Добавить(Справочники.ВопросыШаблонаАнкеты.НайтиПоНаименованию("Первоначальный взнос (собственные средства), руб."));
		МассивВопросов.Добавить(Справочники.ВопросыШаблонаАнкеты.НайтиПоНаименованию("Подтвержденный средний доход, руб."));
	Иначе
		МассивВопросов.Добавить(Справочники.ВопросыШаблонаАнкеты.НайтиПоНаименованию("Фамилия"));
		МассивВопросов.Добавить(Справочники.ВопросыШаблонаАнкеты.НайтиПоНаименованию("Имя"));
		МассивВопросов.Добавить(Справочники.ВопросыШаблонаАнкеты.НайтиПоНаименованию("Отчество"));
		МассивВопросов.Добавить(Справочники.ВопросыШаблонаАнкеты.НайтиПоНаименованию("Дата рождения"));
		МассивВопросов.Добавить(Справочники.ВопросыШаблонаАнкеты.НайтиПоНаименованию("Пол"));
		МассивВопросов.Добавить(Справочники.ВопросыШаблонаАнкеты.НайтиПоНаименованию("Гражданство"));
		МассивВопросов.Добавить(Справочники.ВопросыШаблонаАнкеты.НайтиПоНаименованию("Мобильный телефон"));
		МассивВопросов.Добавить(Справочники.ВопросыШаблонаАнкеты.НайтиПоНаименованию("Серия"));
		МассивВопросов.Добавить(Справочники.ВопросыШаблонаАнкеты.НайтиПоНаименованию("Номер"));
		МассивВопросов.Добавить(Справочники.ВопросыШаблонаАнкеты.НайтиПоНаименованию("Дата выдачи"));
		МассивВопросов.Добавить(Справочники.ВопросыШаблонаАнкеты.НайтиПоНаименованию("Кем выдан"));
		МассивВопросов.Добавить(Справочники.ВопросыШаблонаАнкеты.НайтиПоНаименованию("Код подразделения"));
		МассивВопросов.Добавить(Справочники.ВопросыШаблонаАнкеты.НайтиПоНаименованию("Место рождения"));
		МассивВопросов.Добавить(Справочники.ВопросыШаблонаАнкеты.НайтиПоНаименованию("Сумма кредита, руб"));
		
		ФИОФизЛица = ПоулчитьПаспортныеДанныеКлиента(КонтактноеЛицо);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
       |	ВопросыШаблонаАнкеты.Ссылка КАК ВопросШаблона,
       |	ВопросыШаблонаАнкеты.ЭлементарныйВопрос КАК ЭлементарныйВопрос
       |ИЗ
       |	Справочник.ВопросыШаблонаАнкеты КАК ВопросыШаблонаАнкеты
       |ГДЕ
       |	НЕ ВопросыШаблонаАнкеты.ПометкаУдаления
       |	И ВопросыШаблонаАнкеты.Ссылка В(&МассивВопросов)
       |
       |УПОРЯДОЧИТЬ ПО
       |	ВопросыШаблонаАнкеты.Ссылка ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("МассивВопросов", МассивВопросов);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Ключ = 1 Тогда
				Если Выборка.ВопросШаблона.Наименование = "Семейное положение" Тогда
					НС = Состав.Добавить();
					НС.Вопрос = Выборка.ВопросШаблона;
					ДанныеЗаемщика = Расчет.ДанныеОЗаемщиках.НайтиСтроки(Новый Структура("ФИО", КонтактноеЛицо));
					НС.Ответ = ДанныеЗаемщика[0].СемейноеПоложение;
					НС.ЭлементарныйВопрос = Выборка.ЭлементарныйВопрос;
				ИначеЕсли Выборка.ВопросШаблона.Наименование = "Стоимость ОН" Тогда
					НС = Состав.Добавить();
					НС.Вопрос = Выборка.ВопросШаблона;
					НС.Ответ = Расчет.СтоимостьКвартирыРуб;
					НС.ЭлементарныйВопрос = Выборка.ЭлементарныйВопрос;
				ИначеЕсли Выборка.ВопросШаблона.Наименование = "Первоначальный взнос (собственные средства), руб." Тогда
					НС = Состав.Добавить();
					НС.Вопрос = Выборка.ВопросШаблона;
					НС.Ответ = Расчет.ПервоначальныйВзносРуб;
					НС.ЭлементарныйВопрос = Выборка.ЭлементарныйВопрос;
				ИначеЕсли Выборка.ВопросШаблона.Наименование = "Сумма кредита, руб" Тогда
					НС = Состав.Добавить();
					НС.Вопрос = Выборка.ВопросШаблона;
					НС.Ответ = Расчет.СуммаКредитаРуб;
					НС.ЭлементарныйВопрос = Выборка.ЭлементарныйВопрос;
				ИначеЕсли Выборка.ВопросШаблона.Наименование = "Подтвержденный средний доход, руб." Тогда
					НС = Состав.Добавить();
					НС.Вопрос = Выборка.ВопросШаблона;
					
					ДанныеЗаемщика = Расчет.ДанныеОЗаемщиках.НайтиСтроки(Новый Структура("ФИО", КонтактноеЛицо));
					
					НС.Ответ = ДанныеЗаемщика[0].РазмерЕжемесячногоДохода;
					НС.ЭлементарныйВопрос = Выборка.ЭлементарныйВопрос;
				Иначе
					
				КонецЕсли;
			Иначе
				Если Выборка.ВопросШаблона.Наименование = "Фамилия" Тогда
					НС = Состав.Добавить();
					НС.Вопрос = Выборка.ВопросШаблона;
					НС.Ответ = ФИОФизЛица.Фамилия;
					НС.ЭлементарныйВопрос = Выборка.ЭлементарныйВопрос;
				ИначеЕсли Выборка.ВопросШаблона.Наименование = "Имя" Тогда
					НС = Состав.Добавить();
					НС.Вопрос = Выборка.ВопросШаблона;
					НС.Ответ = ФИОФизЛица.Имя;
					НС.ЭлементарныйВопрос = Выборка.ЭлементарныйВопрос;
				ИначеЕсли Выборка.ВопросШаблона.Наименование = "Отчество" Тогда
					НС = Состав.Добавить();
					НС.Вопрос = Выборка.ВопросШаблона;
					НС.Ответ = ФИОФизЛица.Отчество;
					НС.ЭлементарныйВопрос = Выборка.ЭлементарныйВопрос;
				ИначеЕсли Выборка.ВопросШаблона.Наименование = "Дата рождения" Тогда
					НС = Состав.Добавить();
					НС.Вопрос = Выборка.ВопросШаблона;
					НС.Ответ = КонтактноеЛицо.ДатаРождения;
					НС.ЭлементарныйВопрос = Выборка.ЭлементарныйВопрос;
				ИначеЕсли Выборка.ВопросШаблона.Наименование = "Пол" Тогда
					НС = Состав.Добавить();
					НС.Вопрос = Выборка.ВопросШаблона;
					Если КонтактноеЛицо.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
						НС.Ответ = Справочники.ВариантыОтветовАнкет.НайтиПоНаименованию("Мужской", Истина);
					Иначе
						НС.Ответ = Справочники.ВариантыОтветовАнкет.НайтиПоНаименованию("Женский", Истина);
					КонецЕсли;
					НС.ЭлементарныйВопрос = Выборка.ЭлементарныйВопрос;
				ИначеЕсли Выборка.ВопросШаблона.Наименование = "Гражданство" Тогда
					НС = Состав.Добавить();
					НС.Вопрос = Выборка.ВопросШаблона;
					НС.Ответ = ФИОФизЛица.Гражданство;
					НС.ЭлементарныйВопрос = Выборка.ЭлементарныйВопрос;
				ИначеЕсли Выборка.ВопросШаблона.Наименование = "Мобильный телефон" Тогда
					НС = Состав.Добавить();
					НС.Вопрос = Выборка.ВопросШаблона;
					НС.Ответ = УправлениеТелефониейКлиентСервер.ФорматироватьТелефон(КонтактноеЛицо.ОсновнойТелефон);
					НС.ЭлементарныйВопрос = Выборка.ЭлементарныйВопрос;
				ИначеЕсли Выборка.ВопросШаблона.Наименование = "Серия" Тогда
					НС = Состав.Добавить();
					НС.Вопрос = Выборка.ВопросШаблона;
					НС.Ответ = ФИОФизЛица.Серия;
					НС.ЭлементарныйВопрос = Выборка.ЭлементарныйВопрос;
				ИначеЕсли Выборка.ВопросШаблона.Наименование = "Номер" Тогда
					НС = Состав.Добавить();
					НС.Вопрос = Выборка.ВопросШаблона;
					НС.Ответ = ФИОФизЛица.Номер;
					НС.ЭлементарныйВопрос = Выборка.ЭлементарныйВопрос;
				ИначеЕсли Выборка.ВопросШаблона.Наименование = "Дата выдачи" Тогда
					НС = Состав.Добавить();
					НС.Вопрос = Выборка.ВопросШаблона;
					НС.Ответ = ФИОФизЛица.ДатаВыдачи;
					НС.ЭлементарныйВопрос = Выборка.ЭлементарныйВопрос;
				ИначеЕсли Выборка.ВопросШаблона.Наименование = "Кем выдан" Тогда
					НС = Состав.Добавить();
					НС.Вопрос = Выборка.ВопросШаблона;
					НС.Ответ = ФИОФизЛица.КемВыдан;
					НС.ЭлементарныйВопрос = Выборка.ЭлементарныйВопрос;
				ИначеЕсли Выборка.ВопросШаблона.Наименование = "Код подразделения" Тогда
					НС = Состав.Добавить();
					НС.Вопрос = Выборка.ВопросШаблона;
					НС.Ответ = ФИОФизЛица.КодПодразделения;
					НС.ЭлементарныйВопрос = Выборка.ЭлементарныйВопрос;
				ИначеЕсли Выборка.ВопросШаблона.Наименование = "Место рождения" Тогда
					НС = Состав.Добавить();
					НС.Вопрос = Выборка.ВопросШаблона;
					НС.Ответ = КонтактноеЛицо.МестоРождения;
					НС.ЭлементарныйВопрос = Выборка.ЭлементарныйВопрос;
				Иначе
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ПоулчитьПаспортныеДанныеКлиента(Клиент)
	
	СтруктураПараметров = Новый Структура("АдресПоПропискеКлиента, ВидДокумента, ДатаАкта, ДатаВыдачи, ДатаРождения, Имя, 
										  |КемВыдан, КодПодразделения, МатьНациональность, МатьФИО, МестоРождения, Номер, НомерАкта,
										  |ОтецНациональность, ОтецФИО, Отчество, Пол, Серия, Фамилия, Гражданство");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокументыФизическихЛиц.ФизЛицо КАК ФизЛицо,
		|	МАКСИМУМ(ДокументыФизическихЛиц.Период) КАК Период
		|ПОМЕСТИТЬ вт_СписокКлиентовДляСреза
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
		|ГДЕ
		|	ДокументыФизическихЛиц.ФизЛицо = &ФизЛицо
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокументыФизическихЛиц.ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументыФизическихЛиц.ФизЛицо КАК ФизЛицо,
		|	ДокументыФизическихЛиц.ВидДокумента КАК ВидДокумента
		|ПОМЕСТИТЬ ВТ_АктуальныйВидДокумента
		|ИЗ
		|	вт_СписокКлиентовДляСреза КАК вт_СписокКлиентовДляСреза
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
		|		ПО вт_СписокКлиентовДляСреза.ФизЛицо = ДокументыФизическихЛиц.ФизЛицо
		|			И вт_СписокКлиентовДляСреза.Период = ДокументыФизическихЛиц.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыКонтактнаяИнформация.Представление КАК АдресПоПропискеКлиента,
		|	ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПустаяСсылка) КАК ВидДокумента,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаАкта,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВыдачи,
		|	КлиентыКонтактнаяИнформация.Ссылка.ДатаРождения КАК ДатаРождения,
		|	"""" КАК Имя,
		|	"""" КАК КемВыдан,
		|	"""" КАК КодПодразделения,
		|	"""" КАК МатьНациональность,
		|	"""" КАК МатьФИО,
		|	КлиентыКонтактнаяИнформация.Ссылка.МестоРождения КАК МестоРождения,
		|	"""" КАК Номер,
		|	"""" КАК НомерАкта,
		|	"""" КАК ОтецНациональность,
		|	"""" КАК ОтецФИО,
		|	"""" КАК Отчество,
		|	КлиентыКонтактнаяИнформация.Ссылка.Пол КАК Пол,
		|	"""" КАК Серия,
		|	"""" КАК Фамилия,
		|	1 КАК Сортировка,
		|	"""" КАК Гражданство
		|ИЗ
		|	Справочник.Клиенты.КонтактнаяИнформация КАК КлиентыКонтактнаяИнформация
		|ГДЕ
		|	КлиентыКонтактнаяИнформация.Ссылка = &ФизЛицо
		|	И КлиентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|	И КлиентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПоПропискеКлиента)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	"""",
		|	ДокументыФизическихЛицСрезПоследних.ВидДокумента,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	"""",
		|	ДокументыФизическихЛицСрезПоследних.КемВыдан,
		|	ДокументыФизическихЛицСрезПоследних.КодПодразделения,
		|	"""",
		|	"""",
		|	"""",
		|	ДокументыФизическихЛицСрезПоследних.Номер,
		|	"""",
		|	"""",
		|	"""",
		|	"""",
		|	ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.ПустаяСсылка),
		|	ДокументыФизическихЛицСрезПоследних.Серия,
		|	"""",
		|	2,
		|	""""
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
		|			&Период,
		|			ФизЛицо = &ФизЛицо
		|				И ВидДокумента В
		|					(ВЫБРАТЬ
		|						ВТ_АктуальныйВидДокумента.ВидДокумента
		|					ИЗ
		|						ВТ_АктуальныйВидДокумента КАК ВТ_АктуальныйВидДокумента)) КАК ДокументыФизическихЛицСрезПоследних
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	"""",
		|	ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПустаяСсылка),
		|	СвидетельстваОРожденииФизическихЛицСрезПоследних.ДатаАкта,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	"""",
		|	"""",
		|	"""",
		|	СвидетельстваОРожденииФизическихЛицСрезПоследних.МатьНациональность,
		|	СвидетельстваОРожденииФизическихЛицСрезПоследних.МатьФИО,
		|	"""",
		|	"""",
		|	СвидетельстваОРожденииФизическихЛицСрезПоследних.НомерАкта,
		|	СвидетельстваОРожденииФизическихЛицСрезПоследних.ОтецНациональность,
		|	СвидетельстваОРожденииФизическихЛицСрезПоследних.ОтецФИО,
		|	"""",
		|	ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.ПустаяСсылка),
		|	"""",
		|	"""",
		|	3,
		|	""""
		|ИЗ
		|	РегистрСведений.СвидетельстваОРожденииФизическихЛиц.СрезПоследних(&Период, ФизическоеЛицо = &ФизЛицо) КАК СвидетельстваОРожденииФизическихЛицСрезПоследних
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	"""",
		|	ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПустаяСсылка),
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ФИОФизическихЛицСрезПоследних.Имя,
		|	"""",
		|	"""",
		|	"""",
		|	"""",
		|	"""",
		|	"""",
		|	"""",
		|	"""",
		|	"""",
		|	ФИОФизическихЛицСрезПоследних.Отчество,
		|	ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.ПустаяСсылка),
		|	"""",
		|	ФИОФизическихЛицСрезПоследних.Фамилия,
		|	4,
		|	ЕСТЬNULL(ГражданствоФизическихЛицСрезПоследних.Страна, """")
		|ИЗ
		|	РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&Период, ФизическоеЛицо = &ФизЛицо) КАК ФИОФизическихЛицСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизическихЛиц.СрезПоследних(&Период, ФизическоеЛицо = &ФизЛицо) КАК ГражданствоФизическихЛицСрезПоследних
		|		ПО ФИОФизическихЛицСрезПоследних.ФизическоеЛицо = ГражданствоФизическихЛицСрезПоследних.ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("ФизЛицо", Клиент);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл		
			Если Выборка.Сортировка = 1 Тогда
				ЗаполнитьЗначенияСвойств(СтруктураПараметров, Выборка, "АдресПоПропискеКлиента, Пол, ДатаРождения, МестоРождения");
			ИначеЕсли Выборка.Сортировка = 2 Тогда
				ЗаполнитьЗначенияСвойств(СтруктураПараметров, Выборка, "ВидДокумента, ДатаВыдачи, КемВыдан, КодПодразделения, Номер, Серия");
			ИначеЕсли Выборка.Сортировка = 3 Тогда
				ЗаполнитьЗначенияСвойств(СтруктураПараметров, Выборка, "ДатаАкта, МатьНациональность, МатьФИО, НомерАкта, ОтецНациональность, ОтецФИО");
			ИначеЕсли Выборка.Сортировка = 4 Тогда
				ЗаполнитьЗначенияСвойств(СтруктураПараметров, Выборка, "Имя, Отчество, Фамилия, Гражданство");
			КонецЕсли;					
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции

#КонецОбласти

#КонецЕсли
